itdogwowo/mp_lcd_bus/esp32_src/dsi_bus.c
#include "soc/soc_caps.h"

#if SOC_MIPI_DSI_SUPPORTED

#include "dsi_bus.h"
#include "esp_lcd_panel_ops.h"
#include "esp_lcd_panel_io.h"
#include "esp_heap_caps.h"
#include "esp_cache.h"
#include "esp_memory_utils.h"

#include "py/runtime.h"
#include "py/objarray.h"
#include "py/mphal.h"
#include "py/gc.h"
#include "driver/gpio.h"

#include <string.h>

// ── 本地工具：判斷指針是否落在 IDF 可做 esp_cache_msync 的 PSRAM cacheable 區 ──
// esp_cache_msync 僅接受 PSRAM cacheable 位址 (外部 RAM、非 DMA、非 IRAM/DRAM)。
// 傳入內部 DRAM / PSRAM DMA pool / 對齊後指針越界都會回 ESP_ERR_INVALID_ARG (103)。
static inline bool _dsi_is_psram_cacheable(const void *p) {
    if (p == NULL) return false;
    // esp_ptr_external_ram() = 是否在 PSRAM 虛擬位址區間 (cacheable 映射)
    if (!esp_ptr_external_ram(p)) return false;
    // heap_caps_get_allocated_ptr 驗證真的從 heap 配置而來 (避免 frame buffer 特殊區段)
    return heap_caps_get_allocated_size((void *)p) > 0 || true;
    // 最後一個 || true：內部 fb (由 esp_lcd driver 配置、不透過 heap_caps) 也應為 cacheable PSRAM。
    // esp_ptr_external_ram() 已是充分條件，因此保留 true。
}

// 確保 self->bounce_buf 至少有 need 位元組；回傳 true=配置成功。
// 失敗時不改變原有 buffer (避免洩漏)。
static bool _dsi_ensure_bounce(mp_lcd_dsi_bus_obj_t *self, size_t need) {
    if (self->bounce_buf != NULL && self->bounce_size >= need) return true;
    uint8_t *nb = (uint8_t *)heap_caps_malloc(need, MALLOC_CAP_SPIRAM);
    if (nb == NULL) return false;
    if (self->bounce_buf != NULL) heap_caps_free(self->bounce_buf);
    self->bounce_buf  = nb;
    self->bounce_size = need;
    return true;
}

static mp_lcd_dsi_bus_obj_t *s_last_dsi = NULL;

static bool on_color_trans_done(esp_lcd_panel_handle_t panel,
                                esp_lcd_dpi_panel_event_data_t *edata, void *ctx) {
    mp_lcd_dsi_bus_obj_t *self = (mp_lcd_dsi_bus_obj_t *)ctx;
    // 只認 DMA 槽 (slot_kind==0); 跳過 present 槽 (slot_kind==1)。
    // ⚠ 不能用「第一個未完成槽就 break」— DMA 與 present 槽可能交錯排隊,
    //   頭上若不是自己的來源要跳過去找, 否則互相卡死。
    for (int i = 0; i < self->queue_depth; i++) {
        if (self->ref_bufs[i] != mp_const_none && !self->done_flags[i]
            && self->slot_kind[i] == 0) {
            // 流式 write 會拆成多段 DMA2D 拷貝 — 每段完成遞減一次,
            // 最後一段完成才算該 write 完成 (queue 槽釋放)
            if (self->pending_segments[i] > 0) {
                self->pending_segments[i]--;
                if (self->pending_segments[i] == 0) {
                    self->done_flags[i] = true;
                    self->ref_bufs[i] = mp_const_none;
                    self->slot_kind[i] = 0;      // 釋放即歸零 (下次入隊也會重設)
                    self->queue_head = (self->queue_head + 1) % self->queue_depth;
                    self->queue_count--;
                }
            }
            break;   // 一次 trans-done 只對應一段
        }
    }
    return false;
}

// 幀邊界 (VSYNC) callback — present() 提交 page-flip 後,
// 在此處確認「上一幀掃完、新 fb 已生效」, 該槽才算完成。
// 只認 present 槽 (slot_kind==1); 跳過 DMA 槽。
static bool on_refresh_done(esp_lcd_panel_handle_t panel,
                            esp_lcd_dpi_panel_event_data_t *edata, void *ctx) {
    mp_lcd_dsi_bus_obj_t *self = (mp_lcd_dsi_bus_obj_t *)ctx;
    for (int i = 0; i < self->queue_depth; i++) {
        if (self->ref_bufs[i] != mp_const_none && !self->done_flags[i]
            && self->slot_kind[i] == 1) {
            self->done_flags[i] = true;
            self->ref_bufs[i] = mp_const_none;
            self->slot_kind[i] = 0;      // ⚠ 必重置: 不重置則下次 write() 輪到此槽
            self->queue_head = (self->queue_head + 1) % self->queue_depth;   // 會被當 present 槽跳過 → 卡死
            self->queue_count--;
            break;   // 一個幀邊界只對應一個 present 槽
        }
    }
    return false;
}

static void dsi_deinit_hardware(mp_lcd_dsi_bus_obj_t *self) {
    if (!self->initialized) return;
    if (self->dpi_panel) esp_lcd_panel_del(self->dpi_panel);
    if (self->dbi_io) esp_lcd_panel_io_del(self->dbi_io);
    if (self->bus_handle) esp_lcd_del_dsi_bus(self->bus_handle);
    if (self->reset_pin >= 0) {
        gpio_config_t gc = {
            .mode = GPIO_MODE_INPUT,
            .pin_bit_mask = 1ULL << self->reset_pin,
        };
        gpio_config(&gc);
    }
    // 釋放 PSRAM bounce buffer
    if (self->bounce_buf != NULL) {
        heap_caps_free(self->bounce_buf);
        self->bounce_buf = NULL;
        self->bounce_size = 0;
    }
    self->dpi_panel = NULL;
    self->dbi_io = NULL;
    self->bus_handle = NULL;
    self->initialized = false;
}

static mp_obj_t dsi_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *all_args) {
    enum {
        ARG_lanes, ARG_width, ARG_height,
        ARG_lane_bit_rate_mbps, ARG_dpi_clk_mhz,
        ARG_hsync_pulse_width, ARG_hsync_back_porch, ARG_hsync_front_porch,
        ARG_vsync_pulse_width, ARG_vsync_back_porch, ARG_vsync_front_porch,
        ARG_in_color_format, ARG_fb_count, ARG_rst, ARG_virtual_channel,
        ARG_cmd_bits, ARG_param_bits,
        ARG_use_dma2d, ARG_queue_depth,
    };
    static const mp_arg_t allowed[] = {
        { MP_QSTR_lanes,              MP_ARG_INT | MP_ARG_REQUIRED },
        { MP_QSTR_width,              MP_ARG_INT | MP_ARG_REQUIRED },
        { MP_QSTR_height,             MP_ARG_INT | MP_ARG_REQUIRED },
        { MP_QSTR_lane_bit_rate_mbps, MP_ARG_OBJ | MP_ARG_REQUIRED },
        { MP_QSTR_dpi_clk_mhz,        MP_ARG_OBJ | MP_ARG_KW_ONLY, {.u_obj = MP_OBJ_NULL} },
        { MP_QSTR_hsync_pulse_width,  MP_ARG_INT | MP_ARG_KW_ONLY, {.u_int = 1} },
        { MP_QSTR_hsync_back_porch,   MP_ARG_INT | MP_ARG_KW_ONLY, {.u_int = 10} },
        { MP_QSTR_hsync_front_porch,  MP_ARG_INT | MP_ARG_KW_ONLY, {.u_int = 10} },
        { MP_QSTR_vsync_pulse_width,  MP_ARG_INT | MP_ARG_KW_ONLY, {.u_int = 1} },
        { MP_QSTR_vsync_back_porch,   MP_ARG_INT | MP_ARG_KW_ONLY, {.u_int = 10} },
        { MP_QSTR_vsync_front_porch,  MP_ARG_INT | MP_ARG_KW_ONLY, {.u_int = 10} },
        { MP_QSTR_in_color_format,    MP_ARG_INT | MP_ARG_KW_ONLY, {.u_int = 16} },
        { MP_QSTR_fb_count,           MP_ARG_INT | MP_ARG_KW_ONLY, {.u_int = 2} },
        { MP_QSTR_rst,                MP_ARG_INT | MP_ARG_KW_ONLY, {.u_int = -1} },
        { MP_QSTR_virtual_channel,    MP_ARG_INT | MP_ARG_KW_ONLY, {.u_int = 0} },
        { MP_QSTR_cmd_bits,           MP_ARG_INT | MP_ARG_KW_ONLY, {.u_int = 8} },
        { MP_QSTR_param_bits,         MP_ARG_INT | MP_ARG_KW_ONLY, {.u_int = 8} },
        { MP_QSTR_use_dma2d,          MP_ARG_BOOL | MP_ARG_KW_ONLY, {.u_bool = true} },
        { MP_QSTR_queue_depth,        MP_ARG_INT | MP_ARG_KW_ONLY, {.u_int = DSI_DEFAULT_QUEUE_DEPTH} },
    };
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed)];
    mp_arg_parse_all_kw_array(n_args, n_kw, all_args, MP_ARRAY_SIZE(allowed), allowed, args);

    int lanes = args[ARG_lanes].u_int;
    if (lanes < 1 || lanes > 4)
        mp_raise_msg(&mp_type_ValueError, MP_ERROR_TEXT("DSI data lanes must be 1-4"));

    int bpp = args[ARG_in_color_format].u_int;
    if (bpp != 16 && bpp != 24)
        mp_raise_msg(&mp_type_ValueError, MP_ERROR_TEXT("in_color_format must be 16 (RGB565) or 24 (RGB888)"));

    int nfbs = args[ARG_fb_count].u_int;
    if (nfbs < 1 || nfbs > DSI_MAX_FBS)
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("fb_count must be 1-%d"), DSI_MAX_FBS);

    int qdepth = args[ARG_queue_depth].u_int;
    if (qdepth < 1 || qdepth > DSI_MAX_QUEUE_DEPTH)
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("queue_depth must be 1-%d"), DSI_MAX_QUEUE_DEPTH);

    // only one DSI controller on the chip, tear down a previous instance if any
    if (s_last_dsi) {
        dsi_deinit_hardware(s_last_dsi);
        s_last_dsi = NULL;
    }

